
* 2017
** 2017-04 April
*** 2017-04-26 Wednesday
****工作日志 
:LOGBOOK:  
CLOCK: [2017-04-26 Wed 17:21]--[2017-04-26 Wed 17:24] =>  0:03
:END:      
[2017-04-26 Wed 17:21]
- 调试确认超高频rfid阅读器自动发送卡号的协议
- 配置阅读器的各项参数,保证上传正确的卡号
- 开会进一步明确通道的逻辑接口,各个适配器需要发送的信息
** 2017-05 May
*** 2017-05-02 Tuesday
****工作日志 
:LOGBOOK:  
CLOCK: [2017-05-02 Tue 18:33]--[2017-05-02 Tue 18:37] =>  0:04
:END:      
[2017-05-02 Tue 18:33]
- 编写控件rfid发卡器的协议解析,主要是分祯
- 利用qt的activeqt模块编写串口通讯,参考自带的例子,在其基础上修改
- 调试协议,搭建测试环境,利用写日志的方式排除错误
*** 2017-05-06 Saturday
****工作日记 
:LOGBOOK:  
CLOCK: [2017-05-06 Sat 17:05]--[2017-05-06 Sat 17:13] =>  0:08
:END:      
- 使用qt时继承月QObject的子类需要定义在.h文件中
- 将应用程序依赖的第三方运行时库放到qt的安葬目录下,与qt的动态链接库放到一起
- 编写控件时需要特别注意是否dll文件有依赖
[2017-05-06 Sat 17:04]
*** 2017-05-09 Tuesday
**** 去厂家调试led屏幕 
:LOGBOOK:  
CLOCK: [2017-05-09 Tue 09:54]--[2017-05-09 Tue 10:09] =>  0:15
:END:      
- led屏幕默认显示节目0
- 可以在屏幕上划分不同的区域单独显示不同的节目
- led控制是短连接,获取led屏幕状态需要周期调用api查询,使用设置亮度的api,检查其返回值判断是否有错误
- 屈原有mq模拟客户端,可以发送定制的mq消息,需要上传svn
- 厂家提供有led屏幕的测试程序
[2017-05-09 Tue 09:54]
**** 工作日志 
:LOGBOOK:  
CLOCK: [2017-05-09 Tue 14:32]--[2017-05-09 Tue 14:47] =>  0:15
:END:      
- led 显示屏幕 384*192 512*256
- 俄语字体Tahoma
[2017-05-09 Tue 14:32]
**** 工作日志
- 